
export const allData = [
    {
        year: '16<br />36',
        heading: '事件背景',
        content: (
            <>
                發生在17世紀荷蘭的黃金時代。
                <br />這場狂熱的起源是鬱金香。
                <br />鬱金香原本是一種從土耳其傳入的異國花卉，在荷蘭迅速成為社會地位和財富的象徵。
                <br />人們開始不惜重金收藏稀有品種，特別是那些帶有<span>碎色病毒</span>、花瓣上呈現火焰般條紋的品種。
                <br />隨需求不斷增加，鬱金香價格以驚人的速度飆升。
            </>
        ),
    },
    {
        year: '16<br />37',
        heading: '事件爆發',
        content: (
            <>
                這場瘋狂的投機最終在
                <br /><span>1637年2月崩潰</span>
                <br />一位鬱金香經銷商因找不到買家無法履行合約，導致市場恐慌。
                <br />人們突然意識到鬱金香的實際價值遠遠低於其市場價格，拋售潮隨之而來。
                <br />一夜之間，鬱金香的價格暴跌，許多人傾家蕩產，經濟陷入混亂。
                <br />鬱金香狂熱的破滅，被視為一個經典的投機泡沫案例。
            </>
        ),
    },
];


