import { useRef } from 'react';
import { Link } from "react-router-dom"

import Swiper from '../components/Swiper';
import BackBtnBlack from '../components/BackBtnBlack';
import BackBtnWhite from '../components/BackBtnWhite';

import '../sass/lists.scss';


const Lists = () => {
    // useRef 
    const c16Ref = useRef(null);
    const c17Ref = useRef(null);
    const c18Ref = useRef(null);
    const c19Ref = useRef(null);
    const c20Ref = useRef(null);

    const handleScrollTo = (ref) => {
        ref.current?.scrollIntoView({ behavior: 'smooth' });
    };



    return (
        <>
            <Swiper />
            <section id='lists'>
                <nav>
                    <ul>
                        <li onClick={() => handleScrollTo(c16Ref)}>16xx</li>
                        <li onClick={() => handleScrollTo(c17Ref)}>17xx</li>
                        <li onClick={() => handleScrollTo(c18Ref)}>18xx</li>
                        <li onClick={() => handleScrollTo(c19Ref)}>19xx</li>
                        <li onClick={() => handleScrollTo(c20Ref)}>20xx</li>
                    </ul>
                </nav>

                {/* 西元16XX */}
                <article ref={c16Ref} className="elist">

                    <div className="etitle"><h2 className="t1">16xx</h2></div>

                    <div className="ecard">
                        <div className='elink'>
                            <h3>1636</h3>
                            <Link to="/event1636">
                                <BackBtnBlack />
                            </Link>
                        </div>

                        <div className="content">
                            <h3>鬱金香狂熱</h3>
                            <p>歷史上最離奇的泡沫經濟，一朵鬱金香的價格竟然能買下一棟豪宅？
                                <br />不只是花市的瘋狂，更是人性與資本的鏡像。
                                <br />深入了解這場讓整個荷蘭為之瘋狂的「鬱金香狂熱」，看小小花卉如何引發一場席捲全國的金融風暴。</p>
                        </div>
                    </div>

                </article>
                {/* 西元17XX */}
                <article ref={c17Ref} className="elist">

                    <div className="etitle"><h2 className="t2">17xx</h2></div>

                    <div className="ecard">
                        <div className='elink'>
                            <h3>1720</h3>
                            <Link to="/event1719">
                                <BackBtnWhite />
                            </Link>
                        </div>
                        <div className="content">
                            <h3>密西西比泡沫</h3>
                            <p>法國政府與金融奇才的聯手？
                                <br /> 是什麼迷人的幻象，讓整個巴黎陷入紙鈔與黃金的夢境？
                                <br /> 一場由蘇格蘭人約翰·勞操盤的金融革命，將紙幣、殖民地與國家債務編織成一場盛大的泡沫狂歡。
                                <br />這不只是一次金融災難，更是一場關於信任、權力與人性弱點的深刻寓言。
                                <br />在密西西比河的幻影中，法國曾短暫地相信，金錢可以無中生有。
                            </p>
                        </div>
                    </div>

                    <div className="ecard">
                        <div className='elink'>
                            <h3>1720</h3>
                            <Link to="/event1720">
                                <BackBtnWhite />
                            </Link>
                        </div>
                        <div className="content">
                            <h3>南海泡沫</h3>
                            <p>英國政府與商人的勾結？
                                <br />是什麼神奇的魔力讓著名科學家艾薩克·牛頓入局？
                                <br />當時最聰明的頭腦，也逃不過人性的弱點。
                                <br />這場金融狂熱讓南海公司股價一飛沖天，人人爭相投入，彷彿只要買進就能一夜致富。
                                <br />理性與貪婪的交鋒，讓英國社會陷入瘋狂的「南海泡沫」，看一位科學巨擘如何在金融風暴中迷失方向。</p>
                        </div>
                    </div>


                </article>
                {/* 西元18XX */}
                <article ref={c18Ref} className="elist">

                    <div className="etitle"><h2 className="t1">18xx</h2></div>

                    <div className="ecard">
                        <div className='elink'>
                            <h3>1815</h3>
                            <Link to="/event1815">
                                <button className="btnBack">
                                    <svg xmlns="http://www.w3.org/2000/svg" width="10" height="10" viewBox="0 0 22 19" fill="none">
                                        <path d="M12.2342 10.5694L20.4148 18.0775C21.109 18.714 22 17.9433 22 16.6601V1.64387C22 0.362691 21.1103 -0.410082 20.4148 0.228472L12.2342 7.73657C12.0763 7.87918 11.945 8.08531 11.8537 8.33406C11.7624 8.58282 11.7143 8.86534 11.7143 9.15298C11.7143 9.44063 11.7624 9.72315 11.8537 9.97191C11.945 10.2207 12.0763 10.4268 12.2342 10.5694Z" fill="#323232" />
                                        <path d="M1.30564 10.5694L9.48623 18.0775C10.1805 18.714 11.0714 17.9433 11.0714 16.6601V1.64387C11.0714 0.362691 10.1818 -0.410082 9.48623 0.228472L1.30564 7.73657C1.14771 7.87918 1.01644 8.08531 0.925128 8.33406C0.833821 8.58282 0.785728 8.86534 0.785728 9.15298C0.785728 9.44063 0.833821 9.72315 0.925128 9.97191C1.01644 10.2207 1.14771 10.4268 1.30564 10.5694Z" fill="#323232" />
                                    </svg>
                                </button>
                            </Link>
                        </div>
                        <div className="content">
                            <h3>滑鐵盧密報</h3>
                            <p>情報成了貨幣，倫敦交易所不再是資本的舞台，而是心理戰的戰場。
                                <br />一場由信鴿、快馬與沉默演技交織的套利秀，在滑鐵盧戰後悄悄上演。
                                <br />不是單一投資人的幸運，而是整個家族情報網的精密運作。
                                <br />從假裝悲傷的拋售到低價掃貨的反擊，看羅斯柴爾德如何把戰爭消息變成金山銀礦。
                            </p>
                        </div>
                    </div>
                    <div className="ecard">
                        <div className='elink'>
                            <h3>1864</h3>
                            <Link to="/event1864">
                                <button className="btnBack">
                                    <svg xmlns="http://www.w3.org/2000/svg" width="10" height="10" viewBox="0 0 22 19" fill="none">
                                        <path d="M12.2342 10.5694L20.4148 18.0775C21.109 18.714 22 17.9433 22 16.6601V1.64387C22 0.362691 21.1103 -0.410082 20.4148 0.228472L12.2342 7.73657C12.0763 7.87918 11.945 8.08531 11.8537 8.33406C11.7624 8.58282 11.7143 8.86534 11.7143 9.15298C11.7143 9.44063 11.7624 9.72315 11.8537 9.97191C11.945 10.2207 12.0763 10.4268 12.2342 10.5694Z" fill="#323232" />
                                        <path d="M1.30564 10.5694L9.48623 18.0775C10.1805 18.714 11.0714 17.9433 11.0714 16.6601V1.64387C11.0714 0.362691 10.1818 -0.410082 9.48623 0.228472L1.30564 7.73657C1.14771 7.87918 1.01644 8.08531 0.925128 8.33406C0.833821 8.58282 0.785728 8.86534 0.785728 9.15298C0.785728 9.44063 0.833821 9.72315 0.925128 9.97191C1.01644 10.2207 1.14771 10.4268 1.30564 10.5694Z" fill="#323232" />
                                    </svg>
                                </button>
                            </Link>
                        </div>
                        <div className="content">
                            <h3>綠背風雲</h3>
                            <p>是什麼力量，讓一位總統決定挑戰整個金融秩序？
                                <br /> 在南北戰爭的烈焰中，林肯不只在戰場上搏命，更在貨幣制度裡掀起革命。
                                <br />當銀行家開出天價利率，試圖勒索國家財政，林肯選擇不妥協——他要讓政府自己印鈔。
                                <br />綠背券橫空出世，一張無息紙幣，卻撐起整場戰爭的經濟命脈。 這不只是財政操作，更是主權與制度的交鋒。
                                <br />在金本位的世界裡，林肯用紙幣打贏戰爭，也打破了金融霸權的神話。
                            </p>
                        </div>
                    </div>

                </article>
                {/* 西元19XX */}
                <article ref={c19Ref} className="elist">

                    <div className="etitle"><h2 className="t2">19xx</h2></div>

                    <div className="ecard">
                        <div className='elink'>
                            <h3>1929</h3>
                            <Link to="/event1929">
                                <BackBtnWhite />
                            </Link>
                        </div>
                        <div className="content">
                            <h3>最後狂歡夜</h3>
                            <p>一場看似永不止息的繁榮，竟在一夕之間崩塌——1929年華爾街股災，讓全美陷入前所未有的經濟深淵。
                                <br />當時股市如脫韁野馬，人人爭相投資，銀行放貸毫不手軟，連家庭主婦都開始炒股。
                                <br />但在「黑色星期二」那天，股價如雪崩般狂跌，投資人哀鴻遍野，無數人一夜破產，美國夢瞬間碎裂。
                                <br />當貪婪的警鐘響起，震撼全球的「大蕭條序章」正式拉開帷幕。</p>
                        </div>
                    </div>
                    <div className="ecard">
                        {/* 年分+按鈕 */}
                        <div className='elink'>
                            <h3>1997</h3>
                            <Link to="/event1997">
                                <BackBtnWhite />
                            </Link>
                        </div>
                        {/* 標題內文 */}
                        <div className="content">
                            <h3>索羅斯狙擊</h3>
                            <p>一位「金融巨鱷」讓整個亞洲貨幣市場瞬間失控——1997年，索羅斯狙擊泰銖，引爆亞洲金融危機。
                                <br />索羅斯主導的量子基金大舉做空泰銖，迫使泰國放棄固定匯率制度，泰銖狂跌，骨牌效應席捲亞洲。
                                <br />國家與資本的正面交鋒，深入了解撼動亞洲金融的「索羅斯風暴」，看一場貨幣戰爭如何改寫區域經濟命運。
                            </p>
                        </div>
                    </div>
                    <div className="ecard">
                        {/* 年分+按鈕 */}
                        <div>
                            <h3>1636</h3>
                        </div>
                        {/* 標題內文 */}
                        <div className="content">
                            <h3>鬱金香狂潮</h3>
                            <p>歷史上最離奇的泡沫經濟，一朵鬱金香的價格竟然能買下一棟豪宅？
                                <br />不只是花市的瘋狂，更是人性與資本的鏡像。
                                <br />深入了解這場讓整個荷蘭為之瘋狂的「鬱金香狂熱」，看小小花卉如何引發一場席捲全國的金融風暴。</p>
                        </div>
                    </div>

                </article>
                {/* 西元20XX */}
                <article ref={c20Ref} className="elist">

                    <div className="etitle"><h2 className="t1">20xx</h2></div>
                    <div className="ecard">
                        <div className='elink'>
                            <h3>2008</h3>
                            <Link to="/event2008">
                                <button className="btnBack">
                                    <svg xmlns="http://www.w3.org/2000/svg" width="10" height="10" viewBox="0 0 22 19" fill="none">
                                        <path d="M12.2342 10.5694L20.4148 18.0775C21.109 18.714 22 17.9433 22 16.6601V1.64387C22 0.362691 21.1103 -0.410082 20.4148 0.228472L12.2342 7.73657C12.0763 7.87918 11.945 8.08531 11.8537 8.33406C11.7624 8.58282 11.7143 8.86534 11.7143 9.15298C11.7143 9.44063 11.7624 9.72315 11.8537 9.97191C11.945 10.2207 12.0763 10.4268 12.2342 10.5694Z" fill="#323232" />
                                        <path d="M1.30564 10.5694L9.48623 18.0775C10.1805 18.714 11.0714 17.9433 11.0714 16.6601V1.64387C11.0714 0.362691 10.1818 -0.410082 9.48623 0.228472L1.30564 7.73657C1.14771 7.87918 1.01644 8.08531 0.925128 8.33406C0.833821 8.58282 0.785728 8.86534 0.785728 9.15298C0.785728 9.44063 0.833821 9.72315 0.925128 9.97191C1.01644 10.2207 1.14771 10.4268 1.30564 10.5694Z" fill="#323232" />
                                    </svg>
                                </button>
                            </Link>
                        </div>
                        <div className="content">
                            <h3>金融海嘯</h3>
                            <p>當金融成了賭局，華爾街不再是資本的守門人，而是風險的製造者。
                                <br />一場由房貸、評級與貪婪交織的泡沫秀，終於在雷曼兄弟倒下那刻炸裂全球。
                                <br />不是單一銀行的失誤，而是整個制度的集體失能。
                                <br />從CDO的黑盒子到AIG的保險幻術，看金融工程如何把信任變成毒藥。
                            </p>
                        </div>
                    </div>

                    <div className="ecard">
                        <div className='elink'>
                            <h3>2009</h3>
                            <Link to="/event2009">
                                <button className="btnBack">
                                    <svg xmlns="http://www.w3.org/2000/svg" width="10" height="10" viewBox="0 0 22 19" fill="none">
                                        <path d="M12.2342 10.5694L20.4148 18.0775C21.109 18.714 22 17.9433 22 16.6601V1.64387C22 0.362691 21.1103 -0.410082 20.4148 0.228472L12.2342 7.73657C12.0763 7.87918 11.945 8.08531 11.8537 8.33406C11.7624 8.58282 11.7143 8.86534 11.7143 9.15298C11.7143 9.44063 11.7624 9.72315 11.8537 9.97191C11.945 10.2207 12.0763 10.4268 12.2342 10.5694Z" fill="#323232" />
                                        <path d="M1.30564 10.5694L9.48623 18.0775C10.1805 18.714 11.0714 17.9433 11.0714 16.6601V1.64387C11.0714 0.362691 10.1818 -0.410082 9.48623 0.228472L1.30564 7.73657C1.14771 7.87918 1.01644 8.08531 0.925128 8.33406C0.833821 8.58282 0.785728 8.86534 0.785728 9.15298C0.785728 9.44063 0.833821 9.72315 0.925128 9.97191C1.01644 10.2207 1.14771 10.4268 1.30564 10.5694Z" fill="#323232" />
                                    </svg>
                                </button>
                            </Link>
                        </div>
                        <div className="content">
                            <h3>比特幣崛起</h3>
                            <p>歷史上最反骨的金融創舉，一串程式碼竟敢挑戰央行的權威？
                                <br />不只是科技圈的狂歡，更是制度信仰的重新洗牌。
                                <br />從匿名白皮書到披薩交易的「比特幣革命」，看虛擬貨幣如何在金融海嘯的餘燼中誕生
                                <br />一步步走向全球舞台，挑戰我們對價值、權力與信任的既定認知。
                            </p>
                        </div>
                    </div>

                    <div className="ecard">
                        <div className='elink'>
                            <h3>2021</h3>
                            <Link to="/event2021">
                                <button className="btnBack">
                                    <svg xmlns="http://www.w3.org/2000/svg" width="10" height="10" viewBox="0 0 22 19" fill="none">
                                        <path d="M12.2342 10.5694L20.4148 18.0775C21.109 18.714 22 17.9433 22 16.6601V1.64387C22 0.362691 21.1103 -0.410082 20.4148 0.228472L12.2342 7.73657C12.0763 7.87918 11.945 8.08531 11.8537 8.33406C11.7624 8.58282 11.7143 8.86534 11.7143 9.15298C11.7143 9.44063 11.7624 9.72315 11.8537 9.97191C11.945 10.2207 12.0763 10.4268 12.2342 10.5694Z" fill="#323232" />
                                        <path d="M1.30564 10.5694L9.48623 18.0775C10.1805 18.714 11.0714 17.9433 11.0714 16.6601V1.64387C11.0714 0.362691 10.1818 -0.410082 9.48623 0.228472L1.30564 7.73657C1.14771 7.87918 1.01644 8.08531 0.925128 8.33406C0.833821 8.58282 0.785728 8.86534 0.785728 9.15298C0.785728 9.44063 0.833821 9.72315 0.925128 9.97191C1.01644 10.2207 1.14771 10.4268 1.30564 10.5694Z" fill="#323232" />
                                    </svg>
                                </button>
                            </Link>
                        </div>
                        <div className="content">
                            <h3>GameStop史詩級軋空</h3>
                            <p>歷史上最離奇的泡沫經濟，一朵鬱金香的價格竟然能買下一棟豪宅？
                                <br />不只是花市的瘋狂，更是人性與資本的鏡像。
                                <br />深入了解這場讓整個荷蘭為之瘋狂的「鬱金香狂熱」，看小小花卉如何引發一場席捲全國的金融風暴。</p>
                        </div>
                    </div>

                </article>
            </section>
        </>


    )
}

export default Lists



